# display: flex;  ქმნის flex კონტეინერს და აძლევს შვილ ელემენტებს Flexbox ქცევას 
# flex-direction: row;  განსაზღვრავს მიმართულებას: ჰორიზონტალური (ნაგულისხმევი) 
# justify-content: center;  აწესრიგებს შვილ ელემენტებს მთავარი ღერძის გასწვრივ 
# align-items: center;  აწესრიგებს შვილ ელემენტებს ჯვარედინი ღერძის გასწვრივ 
# gap: 10px;  ქმნის სივრცეს შვილ ელემენტებს შორის 

# flex: 1;  ბავშვის ელემენტის ზომის კონტროლი: 1 პროპორციულად იკავებს თავისუფალ სივრცეს 
# align-self: center;  ინდივიდუალურად განსაზღვრავს ელემენტის პოზიციას ჯვარედინი ღერძზე 



# Content: ელემენტის შიგთავსი 
# width: 200px;  კონტენტის სიგანე 
# height: 100px;  კონტენტის სიმაღლე 
# background-color: lightblue;  კონტენტის ფონი 

# Padding: შიგთავსსა და საზღვარს შორის სივრცე 
# padding: 20px;  შიგთავსს ეძლევა შიდა სივრცე საზღვრამდე 

# Border: ელემენტის საზღვარი 
# border: 5px solid darkblue; საზღვრის ზომა, სტილი და ფერი 

#  Margin: ელემენტსა და სხვა ელემენტებს შორის სივრცე 
# margin: 30px; გარეთა სივრცე სხვა ელემენტებთან 

# დამატებითი სტილი უკეთესი ხილვადობისთვის 
# text-align: center;  ტექსტის ცენტრში განლაგება 
# font-size: 18px;  შრიფტის ზომა 
# color: darkblue;  ტექსტის ფერი 


# margin - padding - border - content

# [ MARGIN ]
#    [ BORDER ]
#       [ PADDING ]
#          [ CONTENT ]
