# Inline - ელემენტები არის ელემენტები რომლებიც არ იკავებენ სრულ ხაზს და განლაგდებიან ერთმანეთის გვერდით

# Block Level - ელემენტები იკავებენ მთლიან რიგს და შემდეგ ყველა სხვა ელემენტი გადავა ახალ ხაზზე

# Inline CSS - არის CSS სტილები რომლებიც პირდაპირ ელემენტის style ატრიბუტში განლაგდება

# Internal CSS - Internal CSS არის სტილები რომლებიც განთავსებულია HTML დოკუმენტის <head> ნაწილში <style> ტეგის შიგნით

# External CSS - External CSS არის CSS ფაილი რომელიც გარეთ განთავსდება და დაკავშირებულია HTML დოკუმენტთან <link> ტეგის მეშვეობით