# რა არის grid გრიდი არის ბადეების სისტემა რომელიც გვეხმარება უფრო კარგად გავაფორმოთ საიტი. ასევე მათში ანუ დივში
# სადაც ელემენტია განლაგებული მას მხოლოდ მაგ სივრცეში შეუძლია გადადგილება (რომელიც გაფორმებულია გრიდით)

# ასევე გრიდის მნიშვნელობა ისა მაგალითად გრიდის დახმარებით შეგვიძლია ფუტერი ნავბარი და სხვადასხვა დივები განვალაგოთ ისე რომ მომხმარებელისთვის კომფორტული იყოს

#  1fr- არის 100px
# (height = 1000; rows = 2) (height = 1900; rows = 10) (height = 300; rows = 9)
#         1000:2= 500px             1900:10=190px                 33,33px