//-------1--------

// document ობიექტი წარმოადგენს დოკუმენტს და გვაძლევს წვდომას მის ელემენტებზე
// მისი დახმარებით შეგვიძლია ელემენტების ძებნა შეცვლა დამატება ან წაშლა...

//-------2--------

// let და const გამოიყენება ცვლადების შესაქმნელად
// განსხვავება:
// - let ცვლადს შეგვიძლია შევუცვალოთ მნიშვნელობა
// - const ცვლადის მნიშვნელობის შეცვლა შეუძლებელია მას შემდეგ რაც ერთხელ მიანიჭებთ რაიმე

// მაგალითი let-ს გამოყენების:
// როდესაც გვინდა რომ ცვლადის მნიშვნელობა მომავალში შეიცვალოს
let count = 0;
count = count + 1;

// მაგალითი const-ს გამოყენების:
// როდესაც გვინდა უცვლელი მნიშვნელობა დარჩეს
const pi = 3.14;


let name = "Mate";
name = "Nia";



// 1. String (ტექსტი)       -"Hello"
// 2. Number (რიცხვი)        - მაგალითად: 42, 3.14
// 3. Boolean (ლოგიკური)     - true ან false
// 4. Null                   - ცვლადს სპეციალურად მინიჭებული აქვს "ცარიელი" მნიშვნელობა
// 5. Object (ობიექტი)       - მაგალითად: {name: "Ana", age: 25}
// 6. Array (მასივი)         - მაგალითად: [1, 2, 3]
// 7. Symbol                 -უნიკალურია ანუ

