#front end - საიტის ის ნაწილი რომელიც ხილულია მომხმარებლისთვის
#Front end - საიტის ის ნაწილი რომელიც უხილავია მომხმარებლისთვის
#Back end - საიტის ან აპლიკაცის ის ნაწილია რომელიც წარმოქმნის საიტის ფუნქციებს და მომხმარებლისთვის უხილავია

#ჩამოწერეთ front-end-ის 3 ძირითადი ნაწილი და ახსენით რაში ვიყენებთ მათ
#HTML - ეს არი პროგრამული ენა რომელიც ქმნის საიტის სტრუქტურას
#CSS - არი პროგრამირების ენა რომელითაც მომხმარებელს აქვს საშვალება გააფორმოს საიტი
#Java Script - არი ენა რომელიც ვებ გვერდზე ქმნის ინტერაქტიულ ელემენტებს როგორიცა საიტზე ღილაკის დაჭერის შემდეგ ახალი ფანჯრის გახსნა და ასე შემდეგ
