# 1

# სია (List): მოწესრიგებული ინდექსირებადი
# Set: მოუწესრიგებელი უნიკალური შეცვლა რამის შეუძლებეილა

# 2

numbers = {1, 2, 3, 4, 5}

# ინდექსინგი Set-ში არ მუშაობს რადგან ის უცვლელი სტრუქტურაა
# ამიტომ ეს კოდი გამოიწვევს შეცდომას
numbers[0] = 10

# 3 

fast = {"ბურგერი", "პიცა", "ფრი", "ჰოთ-დოგი"}
fast.clear()  # ვშლით ყველა ელემენტს
fast.update({"სალათი", "ხილი", "ბოსტნეული", "იოგურტი"}) # ვამატებთ ჯანსაღ საკვებს
print(fast)


# 4 

def em_dupli(my_list):
    return list(set(my_list))

list1 = [7, 5, 44, 14, 5, 5, 44]
list2 = [89, 90, 56, 45, 90, 78, 90]

print(em_dupli(list1))
print(em_dupli(list2))