# 1. type- განსაზღვრავს ველის ტიპს <input> ელემენტში გვხდება მაგალითად 
# text, email, radio, number და ასე შემდეგ

# 2. name- ატრიბუტი რომელიც ველისთვის უნიკალურ იდენტიფიკატორია
# მაგალითად <input type="password" name="password">

# 3. value- განსაზღვრავს ფორმის ველის საწყის

# 4. required- მიუთითებს მომხმარებელს რომ ველი სავალდებულოა რომ შეავსოს და მომხმარებელმა მასში უნდა შეიყვანოს მონაცემები გაგზავნამდე
# მაგალითად <input type="email" required> და სანამ არ ჩაწერს მომხმარებელი მაილს არ გაიგზანება

# 5. placeholder- ტექსტი რომელიც დროებით ჩანს ველში სანამ მომხმარებელი შიგნით რამეს დაწერს
# მაგალითად <input type="text" placeholder="Enter your name">

# 6. id-  ელემენტის უნიკალური იდენტიფიკატორია რომელიც გამოიყენება  ელემენტის მიმართვისთვის
# მაგალითად <input type="text" id="username">
#            <label for="username">Username:</label>


# 7. for- <label> ელემენტში და მიუთითებს იმ ფორმის ველს სადაც id-სთან  არის დაკავშირებული
