#5 დავალება
#ალგორითმი არის რაღაც მოქმედებათა ერთობლიობის ზუსტი და სრული აღწერა და რომელიც სრული სიმკაცრიდ უნდა შესრულდეს 
#ალგორითმის მაგალითად- პიცას რეცეპტი, ან კომპიუტერის აწყობა და ხის დარგვის ალგორითმი

#6 დავალება
#ალგორითმის გამოსახვის ტექნიკა არის მაგალითად
#ფოტოთი ალგორითმის გამოსახვა არის flowchart-ი
#ასევე ფსევდო კოდი არის ალგორითმის გამოსახვა რომელიც იყენებს ნატურალურ ენას და პროგრამირების ელემენტებს

#7 დავალება
#ჩვენ გავიარეთ control flow-ს 3 მაგალითი- Sequences, iterations, selections.

#Sequences - კოდის თანმიმდევრობით ჩამოწერა
#iterations - იტერაცია(ერთიდაიგივე მოქმედების ბევრჯერ გამეორება)
#selections - არჩევა