print(True or False and 5 > 3 or "name" == "name" and 123 == "123" and 5 >= 5)

#True or False # აქ იქნება True რადგან თუ ერთი პირობა თუა შესრულებული იქნება True თუ არ იქნება მაშინ False
#5 > 3 აქ იქნება True რადგან მართლაც 5 მეტია 3-მზე
#"name" == "name" აქ იქნება True რადგან name იდენტურია name ეს. და აქ ორი სიტყვა იდენტურია ერთმანეთის
#123 == "123" აქ იქნება False რადგან "123" არის str ფორმაში "" გამო და int არა იდენტური str ის და მაგიტომაც False არის
#5 >= 5 აქ ">=" არის შედარებააქ 5 ტოლია 5 რადგან ერთი და იგივეა და იქნება True 

#და საბოლოდ იქნება მთლიანობაში True (True or False and 5 > 3)- აქ რომ იქნება True მოდით დავიმახსოვროთ რომ შემდგომ სტრუქტურა ავაგოთ!
#("name" == "name")-აქ იქნება True
#(123 == "123")-აქ იქნება False 
#(5 >= 5)-აქ იქნება True
#print(True and True or True and False and False)= პასუხია True
