# Inline CSS- სტილი პირდაპირ HTML ელემენტში ინახება style ატრიბუტის გამოყენებით
# Internal CSS- სტილები განთავსებულია <style> ტეგში, რომელიც HTML დოკუმენტის <head> ნაწილშია
# External CSS- სტილები ინახება ცალკე .css ფაილში, რომელიც HTML დოკუმენტში link ტეგით უკავშირდება.

# სელექტორი არის ნაწილი რომელიც განსაზღვრავს რომელ HTML ელემენტზე უნდა გავრცელდეს სტილი
# დეკლარაცია არის სტილზე მახასიათებლის და მისი მნიშვნელობის კომბინაცია რომელიც სელექტორისთვის გამოიყენება
# ID სელექტორი- გამოიყენება უნიკალური ელემენტის სტილის განსასაზღვრად იწერება # სიმბოლოს გამოყენებით
# Class სელექტორი- გამოიყენება ელემენტების ჯგუფისთვის იწერება სიმბოლოს გამოყენებით
# Element სელექტორი- გამოიყენება HTML ელემენტების ტიპისთვის