// 2) let და const განსხვავება
let age = 25;
age = 26;

const name = "Giorgi";

// 5) ცვლადის შექმნა და განახლება
let count = 10;
count = 20;
console.log("განახლებული count -", count);

// 3) ღილაკზე alert (ფუნქციის გარეშე – პირდაპირ გამოვიძახოთ)
alert("გოა მაგარია ბრატ, წარმატებები!");

// 4) სურათის ზომის შეცვლა (ფუნქციის გარეშე – პირდაპირ წვდომა ელემენტზე)
let img = document.getElementById("myImage");
img.width += 100;

// 6) კოდის ანალიზი
let x = 5;
console.log(x++); // იქნება 5, რადგან პირველად ბეჭდავს და მერე ზრდის
console.log(++x); // ახლა იქნება 7, რადგან პირველად ზრდის და მერე ბეჭდავს
