#task-1

#controls - ეს ატრიბუტი მომხმარებელს აჩვენებს მედია პლეერს ინტერფეისთან ერთად რომელშიც შედის ღილაკები როგორიცაა "play" "pause" ხმა და ხმის რეგულირების შესაძლებლობა
#loop - ეს ატრიბუტი მიუთითებს რომ მედია ფაილი დასრულების შემდეგ ავტომატურად თავიდან უნდა ჩაირთოს
#muted - ეს ატრიბუტი მედია ფაილის ჩატვირთვისას ავტომატურად გამორთავს ხმას
#autoplay - ეს ატრიბუტი მიუთითებს რომ მედია ფაილი ავტომატურად უნდა დაიწყოს გაშვება გვერდის ჩატვირთვისთანავე 

#task-2

# <head> და <header> თეგები ერთმანეთისგან განსხვავებულ როლებს ასრულებენ
# შეიცავს ინფორმაციას რომელიც არ ჩანს პირდაპირ ვებგვერდის მომხმარებლისთვის მაგრამ მნიშვნელოვანია ბრაუზერისთვის
# შეიცავს ვებსაიტის ან სექციის სახელწოდებას ნავიგაციას ლოგოს და სხვა ვიზუალურ ელემენტებს

# განსხვავება 
# <head>  განკუთვნილია მეტამონაცემებისთვის,	არ ჩანს პირდაპირ მომხმარებლისთვის
# <header> განკუთვნილია გვერდის ან სექციის სათაურისთვის, ჩანს მომხმარებლისთვის 

