#კონტეინერი (Container) არის ელემენტი რომლის დავალება ელემენტების დააჯგუფება
#ცარიელი ელემენტი (Empty Element) ცარიელი ელემენტს  შიდა შინაარსი არ აქვს მაგალითად ესინია (<img src="">)(/br)(input(": "))

#კომენტარიები კომპიუტერის მიერ არ იკითხება და კოდის წერისას კომპიუტერი ვერ ხედავს კომენტარიებს და ისინი გამოიყენება სხვა დეველოპერებისთვის ინფორმაციის გადასაცემად
#python-ში კომენტარიები # იწერება
#html-ში კომენტარიები <!--  --> იწერება
#css-ში კომენტარიები /*  */ იწერება
#js-ში კომენტარიები // იწერება
#c-ში კომენტარიები // იწერება
#c++-ში კომენტარიები // იწერება


#ატრიბუტები პროგრამირებაში არის ობიექტის მახასიათებლები
#ატრიბუტები შეიძლება იყოს : სახელი, ასაკი, სქესი, მისამართი და სხვა.
